Programming-Lisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-18 Fri 10:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lisp</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jonathan Arkell" />
<link href="https://fonts.googleapis.com/css?family=Inconsolata|Nixie+One|Taviraj:300,400" rel="stylesheet"><link href="./assets/styles/tufte-style.css" rel="stylesheet"></head>
<body>
<div id="preamble" class="status">
<menu class="top"><a href="index.html"> Index </a><a href="Emagician.html"> Emagician </a><a href="Emagician-Base.html"> Base </a><a href="Emagician-Install.html"> Install </a><a href="Emagician-Meta.html"> Meta </a><a href="Interface.html"> Interface </a><a href="Programming.html"> Programming </a><a href="Text.html"> Text </a><a href="Org-Grimoire.html"> Org </a><a href="Lamp.html"> Lamp </a><a href="Journal.html"> Journal </a><a href="Snippets.html"> Snippets </a></menu><menu class="ext"><a class="dotnet" href="http://www.jonnay.net/">jonnay.net</a><a class="github" href="https://github.com/jonnay/emagicians-starter-kit">Fork on Github</a></menu>
</div>
<div id="content">
<h1 class="title">Lisp</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org205499b">1. Set up a generalized Lisp mode hook</a></li>
<li><a href="#org95c73ea">2. Editing</a>
<ul>
<li><a href="#org6aadb50">2.1. Paredit</a></li>
<li><a href="#org4fe5058">2.2. Smart Parens</a></li>
</ul>
</li>
<li><a href="#orgac1188e">3. Individual Lisps</a>
<ul>
<li><a href="#org930952c">3.1. Elisp</a>
<ul>
<li><a href="#orgae59f6b">3.1.1. Editing</a>
<ul>
<li><a href="#org2b2785e">3.1.1.1. Highlighting</a></li>
<li><a href="#orgab17b79">3.1.1.2. Eldoc</a></li>
<li><a href="#org058edac">3.1.1.3. Auto Complete</a></li>
<li><a href="#orgffab645">3.1.1.4. Indentation</a></li>
<li><a href="#orgab30db5">3.1.1.5. Package checking</a>
<ul>
<li><a href="#org5a12737">3.1.1.5.1. Turn off in orc-src buffers</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgdcce3e1">3.1.2. Environment</a></li>
</ul>
</li>
<li><a href="#orge2a59b5">3.2. Scheme</a>
<ul>
<li><a href="#org7fefdbd">3.2.1. Editing</a>
<ul>
<li><a href="#org288d62b">3.2.1.1. Intenting</a></li>
</ul>
</li>
<li><a href="#org760320e">3.2.2. Interface</a>
<ul>
<li><a href="#org1687861">3.2.2.1. Geiser REPL</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org205499b" class="outline-2">
<h2 id="org205499b"><span class="section-number-2">1</span> Set up a generalized Lisp mode hook</h2>
<div class="outline-text-2" id="text-1">
<pre class="code"><code>(<span class="org-keyword">defvar</span> <span class="org-variable-name">generic-lisp-mode-hook</span> '()
  <span class="org-doc">"Generic lisp hooks to run"</span>)
</code></pre>

<pre class="code"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">run-lisp-mode-hooks</span> ()
  <span class="org-doc">"Run standard lisp mode hooks"</span>
  (run-hooks 'generic-lisp-mode-hook))
</code></pre>

<pre class="code"><code>(<span class="org-keyword">dolist</span> (hook '(scheme-mode-hook clojure-mode-hook lisp-mode-hook emacs-lisp-mode-hook))
  (add-hook hook 'run-lisp-mode-hooks))
</code></pre>
</div>
</div>

<div id="outline-container-org95c73ea" class="outline-2">
<h2 id="org95c73ea"><span class="section-number-2">2</span> Editing</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6aadb50" class="outline-3">
<h3 id="org6aadb50"><span class="section-number-3">2.1</span> Paredit</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">paredit</span>
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:diminish</span> <span class="org-string">"&#9387;"</span>
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">emagician/minor-in-major-mode</span> paredit-mode generic-lisp-mode-hook))
</code></pre>
</div>
</div>

<div id="outline-container-org4fe5058" class="outline-3">
<h3 id="org4fe5058"><span class="section-number-3">2.2</span> Smart Parens</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Turn this shit off on lisps
</p>

<pre class="code"><code>(add-hook 'generic-lisp-mode-hook #'turn-off-smartparens-mode t)
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgac1188e" class="outline-2">
<h2 id="orgac1188e"><span class="section-number-2">3</span> Individual Lisps</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org930952c" class="outline-3">
<h3 id="org930952c"><span class="section-number-3">3.1</span> Elisp</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgae59f6b" class="outline-4">
<h4 id="orgae59f6b"><span class="section-number-4">3.1.1</span> Editing</h4>
<div class="outline-text-4" id="text-3-1-1">
</div>
<div id="outline-container-org2b2785e" class="outline-5">
<h5 id="org2b2785e"><span class="section-number-5">3.1.1.1</span> Highlighting</h5>
<div class="outline-text-5" id="text-3-1-1-1">
<pre class="code"><code>(<span class="org-keyword">with-eval-after-load</span> 'dash
  (dash-enable-font-lock))
</code></pre>
</div>
</div>

<div id="outline-container-orgab17b79" class="outline-5">
<h5 id="orgab17b79"><span class="section-number-5">3.1.1.2</span> Eldoc</h5>
<div class="outline-text-5" id="text-3-1-1-2">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">eldoc</span>
  <span class="org-builtin">:diminish</span> <span class="org-string">""</span>
  <span class="org-builtin">:init</span> 
    (<span class="org-keyword">setq</span> eldoc-idle-delay 0.1)
    (add-hook 'emacs-lisp-mode-hook 'turn-on-eldoc-mode)
  <span class="org-builtin">:config</span>
    (set-face-attribute 'eldoc-highlight-function-argument nil
                        <span class="org-builtin">:underline</span> t <span class="org-builtin">:foreground</span> <span class="org-string">"green"</span>
                        <span class="org-builtin">:weight</span> 'bold))
</code></pre>
</div>
</div>


<div id="outline-container-org058edac" class="outline-5">
<h5 id="org058edac"><span class="section-number-5">3.1.1.3</span> Auto Complete</h5>
<div class="outline-text-5" id="text-3-1-1-3">
<pre class="code"><code>(<span class="org-keyword">emagician/defhook</span> emagician/ac-set-elisp-sources emacs-lisp-mode
  (<span class="org-keyword">setq</span> ac-sources
        '(ac-source-yasnippet
          ac-source-functions
          ac-source-features
          ac-source-variables
          ac-source-symbols
          ac-source-files-in-current-dir
          ac-source-words-in-buffer
          ac-source-words-in-same-mode-buffers)))
</code></pre>
</div>
</div>
<div id="outline-container-orgffab645" class="outline-5">
<h5 id="orgffab645"><span class="section-number-5">3.1.1.4</span> Indentation</h5>
<div class="outline-text-5" id="text-3-1-1-4">
<pre class="code"><code>(put 'use-package 'lisp-indent-function 1)
(put 'lexically 'lisp-indent-function 0)
</code></pre>
</div>
</div>

<div id="outline-container-orgab30db5" class="outline-5">
<h5 id="orgab30db5"><span class="section-number-5">3.1.1.5</span> Package checking</h5>
<div class="outline-text-5" id="text-3-1-1-5">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">flycheck-package</span>
  <span class="org-builtin">:config</span> 
  (flycheck-package-setup))
</code></pre>
</div>

<div id="outline-container-org5a12737" class="outline-6">
<h6 id="org5a12737"><span class="section-number-6">3.1.1.5.1</span> Turn off in orc-src buffers</h6>
<div class="outline-text-6" id="text-3-1-1-5-1">
<p>
Don't flycheck in emacs-lisp-mode org-src buffers!  SO ANNOYING!
</p>

<pre class="code"><code>(<span class="org-keyword">emagician/defhook</span> turn-off-flycheck-in-emacs-lisp org-src-mode-hook
  (<span class="org-keyword">when</span> (equal mode-name <span class="org-string">"Emacs-Lisp"</span>)
    (flycheck-mode -1)))
</code></pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdcce3e1" class="outline-4">
<h4 id="orgdcce3e1"><span class="section-number-4">3.1.2</span> Environment</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
See <a href="./Emagician-Base.html">./Emagician-Base.html</a>
</p>
</div>
</div>
</div>

<div id="outline-container-orge2a59b5" class="outline-3">
<h3 id="orge2a59b5"><span class="section-number-3">3.2</span> Scheme</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org7fefdbd" class="outline-4">
<h4 id="org7fefdbd"><span class="section-number-4">3.2.1</span> Editing</h4>
<div class="outline-text-4" id="text-3-2-1">
</div>
<div id="outline-container-org288d62b" class="outline-5">
<h5 id="org288d62b"><span class="section-number-5">3.2.1.1</span> Intenting</h5>
<div class="outline-text-5" id="text-3-2-1-1">
<pre class="code"><code><span class="org-comment-delimiter">;; </span><span class="org-comment">Indenting module body code at column 0</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">scheme-module-indent</span> (state indent-point normal-indent) 0)
(put 'module 'scheme-indent-function 'scheme-module-indent)

(put 'and-let* 'scheme-indent-function 1)
(put 'parameterize 'scheme-indent-function 1)
(put 'handle-exceptions 'scheme-indent-function 1)
(put 'when 'scheme-indent-function 1)
(put 'unless 'scheme-indent-function 1)
(put 'match 'scheme-indent-function 1)
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org760320e" class="outline-4">
<h4 id="org760320e"><span class="section-number-4">3.2.2</span> Interface</h4>
<div class="outline-text-4" id="text-3-2-2">
</div>
<div id="outline-container-org1687861" class="outline-5">
<h5 id="org1687861"><span class="section-number-5">3.2.2.1</span> Geiser REPL</h5>
<div class="outline-text-5" id="text-3-2-2-1">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">geiser</span>
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> geiser-active-implementations '(chicken))
  <span class="org-builtin">:config</span> 
  (<span class="org-keyword">emagician/defhook</span> emagician/ac-set-scheme-sources scheme-mode-hook))
</code></pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jonathan Arkell</p>
<p class="date">Created: 2018-05-18 Fri 10:30</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
